https://github.com/codewithlennylen/Python-SQLite-Tutorials

# 1)-Creating a Database File

In [1]:
import sqlite3

dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')


dbase.close()
print (' Database Closed')

Database opened
 Database Closed

# 2)- Creating a table

In [2]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')

Database opened

In [3]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [4]:
dbase.close()
print (' Database Closed')

 Database Closed

# 3)-Inserting records to our database

In [5]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')

Database opened

In [6]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [7]:
dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
        VALUES(5,'James','Maintenance',4)
''')

In [8]:
dbase.commit()
print ('REcord inserted')

REcord inserted

In [9]:
dbase.close()
print (' Database Closed')

 Database Closed

# 4)-Variables to insert data

In [10]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')

Database opened

In [11]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [0]:
def insert_record(ID,NAME,DIVISION,STARS):
    dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
            VALUES(?,?,?,?)''',(ID,NAME,DIVISION,STARS))

    dbase.commit()
    print ('REcord inserted')

In [13]:
insert_record(6,'Bob','Hardware',4)

REcord inserted

In [14]:
dbase.close()
print (' Database Closed')

 Database Closed

# 5)- Reading Data from a Database

In [15]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')

Database opened

In [16]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [0]:
def insert_record(ID,NAME,DIVISION,STARS):
    dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
            VALUES(?,?,?,?)''',(ID,NAME,DIVISION,STARS))

    dbase.commit()
    print ('REcord inserted')

In [18]:
def read_Data():
    # from math import *
    data = dbase.execute(''' SELECT * FROM employee_records ORDER BY NAME''')
    for record in data:
        print ('ID : '+str(record[0]))
        print ('NAME : '+str(record[1]))
        print ('DIVISION : '+str(record[2]))
        print ('STARS : '+str(record[3])+'\n')


read_Data()

ID : 6
NAME : Bob
DIVISION : Hardware
STARS : 4

ID : 5
NAME : James
DIVISION : Maintenance
STARS : 4

In [19]:
dbase.close()
print (' Database Closed')

 Database Closed

# 6)- Updating a record

In [20]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')

Database opened

In [21]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [0]:
def insert_record(ID,NAME,DIVISION,STARS):
    dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
            VALUES(?,?,?,?)''',(ID,NAME,DIVISION,STARS))

    dbase.commit()
    print ('REcord inserted')

In [23]:
def read_Data():
    # from math import *
    data = dbase.execute(''' SELECT * FROM employee_records ORDER BY NAME''')
    for record in data:
        print ('ID : '+str(record[0]))
        print ('NAME : '+str(record[1]))
        print ('DIVISION : '+str(record[2]))
        print ('STARS : '+str(record[3])+'\n')


read_Data()

ID : 6
NAME : Bob
DIVISION : Hardware
STARS : 4

ID : 5
NAME : James
DIVISION : Maintenance
STARS : 4

In [24]:
def update_record():
    dbase.execute(''' UPDATE employee_records set STARS=3 WHERE ID=2 ''')
    dbase.commit()
    print ('Updated')

update_record()
print ('----------------------')
read_Data()

Updated
----------------------
ID : 6
NAME : Bob
DIVISION : Hardware
STARS : 4

ID : 5
NAME : James
DIVISION : Maintenance
STARS : 4

In [25]:
dbase.close()
print (' Database Closed')

 Database Closed

# 7)- Delete a record

In [26]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
print ('Database opened')

Database opened

In [27]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [0]:
def insert_record(ID,NAME,DIVISION,STARS):
    dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
            VALUES(?,?,?,?)''',(ID,NAME,DIVISION,STARS))

    dbase.commit()
    print ('REcord inserted')

In [0]:
def read_Data():
    # from math import *
    data = dbase.execute(''' SELECT * FROM employee_records ORDER BY NAME''')
    for record in data:
        print ('ID : '+str(record[0]))
        print ('NAME : '+str(record[1]))
        print ('DIVISION : '+str(record[2]))
        print ('STARS : '+str(record[3])+'\n')

In [0]:
def update_record():
    dbase.execute(''' UPDATE employee_records set STARS=3 WHERE ID=2 ''')
    dbase.commit()
    print ('Updated')

In [31]:
def delete_record():
    dbase.execute(''' DELETE from employee_records WHERE ID = 1 ''')
    dbase.commit()
    print ('Deleted')

delete_record()
print ('----------------------')
read_Data()

Deleted
----------------------
ID : 6
NAME : Bob
DIVISION : Hardware
STARS : 4

ID : 5
NAME : James
DIVISION : Maintenance
STARS : 4

# 8)- Adding more

In [32]:
dbase = sqlite3.connect('Our_data.db') # Open a database File
cursor = dbase.cursor()
print ('Database opened')
print ('Cursor created')

Database opened
Cursor created

In [33]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')

print ('Table created')

Table created

In [0]:
def read_Data():
    # from math import *
    data = cursor.execute(''' SELECT * FROM employee_records ORDER BY NAME''')
    for record in data:
        print ('ID : '+str(record[0]))
        print ('NAME : '+str(record[1]))
        print ('DIVISION : '+str(record[2]))
        print ('STARS : '+str(record[3])+'\n')

In [0]:
def check_Data():
    # from math import *
    data = cursor.execute(''' SELECT NAME FROM employee_records WHERE ID =2''')
    x = data.fetchall()
    if x == []:
        print ('Doesnt exist')
    else:
        print (x)

In [36]:
def update_record():
    dbase.execute(''' UPDATE employee_records set STARS=3 WHERE ID=2 ''')
    dbase.commit()
    print ('Updated')


dbase.close()
print (' Database Closed')

 Database Closed